# 데이터프레임 합성

In [1]:
import numpy as np
import pandas as pd

## merge 함수

In [2]:
# 두 데이터 프레임의 공통 열 혹은 인덱스를 기준으로 두 개의 테이블을 합친다. (주로 인덱스 기준)
# 이 때 기준이 되는 열, 행의 데이터를 키(key)라고 한다.

In [3]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [5]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [6]:
# Inner Join
pd.merge(df1, df2)  # how='inner' : default

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [7]:
# Left Outer Join
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [8]:
# Right Outer Join
pd.merge(df1, df2, how='right') # right를 지원하지 않는 경우 df1, df2 위치바꾸고 left로 merge

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [9]:
# Full Outer Join
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [ ]:
# 두 데이터프레임에서 이름이 같은 열은 모두 키가 된다.
# 만약 이름이 같아도 키가 되면 안되는 열이 있다면 on 인수로 기준열을 명시해야 한다.

In [10]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [11]:
df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [12]:
pd.merge(df1, df2, on='고객명') # 이름이 같은 열이 두개 있음 : 고객명과 데이터, 고객명을 기준열로 지정

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

In [14]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [15]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [16]:
# 키가 되는 기준열의 이름이 두 데이터프레임에서 다르다면 left_on, right_on 인수를 사용하여 기준열을 명시해야 한다.
pd.merge(df1, df2, left_on='이름', right_on='성명')

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6

## join method

In [22]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1.set_index('고객번호', inplace=True)
df1

       이름
고객번호
1001   둘리
1002  도우너
1003   또치
1004   길동
1005   희동
1006  마이콜
1007   영희

In [23]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2.set_index('고객번호', inplace=True)
df2

          금액
고객번호
1001   10000
1001   20000
1005   15000
1006    5000
1008  100000
1001   30000

In [24]:
# join을 사용하기 위해서는 index를 갖게 해야 함!
df1.join(df2, how='inner')  # how='left' : default

       이름     금액
고객번호
1001   둘리  10000
1001   둘리  20000
1001   둘리  30000
1005   희동  15000
1006  마이콜   5000

In [25]:
df1.join(df2)      # Left outer join

       이름       금액
고객번호
1001   둘리  10000.0
1001   둘리  20000.0
1001   둘리  30000.0
1002  도우너      NaN
1003   또치      NaN
1004   길동      NaN
1005   희동  15000.0
1006  마이콜   5000.0
1007   영희      NaN

## concat 함수

In [26]:
# 기준 열(key column)을 사용하지 않고 단순히 데이터를 연결(concatenate)
s1 = pd.Series([0, 1], index=['A','B'])
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])

In [27]:
s1

A    0
B    1
dtype: int64

In [28]:
s2

A    2
B    3
C    4
dtype: int64

In [30]:
pd.concat([s1, s2]) # 리스트 형태로 입력

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [31]:
# 옆으로 데이터 열을 연결하고 싶으면 axis=1로 인수를 설정

In [32]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [33]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [34]:
pd.concat([df1, df2], axis=1) # join='outer' : default

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

### 연습문제2
어느 회사의 전반기(1월 ~ 6월) 실적을 나타내는 데이터프레임과 후반기(7월 ~ 12월) 실적을 나타내는 데이터프레임을 만든 뒤 합친다. 실적 정보는 “매출”, “비용”, “이익” 으로 이루어진다. (이익 = 매출 - 비용).

또한 1년간의 총 실적을 마지막 행으로 덧붙인다.

In [48]:
df1 = pd.DataFrame(np.random.randint(100, 1000, size=(6,2)),
                   columns = ['매출', '비용'],
                   index=['1월', '2월', '3월', '4월', '5월', '6월'])
df1['이익'] = df1.매출 - df1.비용
df1

     매출   비용   이익
1월  574  180  394
2월  161  758 -597
3월  629  608   21
4월  563  287  276
5월  464  681 -217
6월  906  448  458

In [49]:
df2 = pd.DataFrame(np.random.randint(100, 1000, size=(6,2)),
                   columns = ['매출', '비용'],
                   index=['7월', '8월', '9월', '10월', '11월', '12월'])
df2['이익'] = df2.매출 - df2.비용
df2

      매출   비용   이익
7월   640  448  192
8월   259  168   91
9월   487  709 -222
10월  288  581 -293
11월  656  117  539
12월  894  408  486

In [50]:
df = pd.concat([df1, df2])
df

      매출   비용   이익
1월   574  180  394
2월   161  758 -597
3월   629  608   21
4월   563  287  276
5월   464  681 -217
6월   906  448  458
7월   640  448  192
8월   259  168   91
9월   487  709 -222
10월  288  581 -293
11월  656  117  539
12월  894  408  486

In [51]:
tdf = pd.DataFrame(df.sum()).T
tdf

     매출    비용    이익
0  6521  5393  1128

In [52]:
tdf.index = ['합계']
tdf

      매출    비용    이익
합계  6521  5393  1128

In [53]:
df = pd.concat([df, tdf])
df

       매출    비용    이익
1월    574   180   394
2월    161   758  -597
3월    629   608    21
4월    563   287   276
5월    464   681  -217
6월    906   448   458
7월    640   448   192
8월    259   168    91
9월    487   709  -222
10월   288   581  -293
11월   656   117   539
12월   894   408   486
합계   6521  5393  1128